; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	image2 - mode
	image1 - mode
	infrared0 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	GroundStation5 - direction
	Star3 - direction
	Star4 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 image2)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 image2)
	(supports instrument2 image1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument3 infrared0)
	(supports instrument3 image2)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument5 image2)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star3)
	(supports instrument6 infrared0)
	(supports instrument6 image2)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 Star3)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(supports instrument7 image2)
	(calibration_target instrument7 GroundStation1)
	(supports instrument8 infrared0)
	(supports instrument8 image1)
	(calibration_target instrument8 GroundStation5)
	(supports instrument9 image1)
	(supports instrument9 infrared0)
	(supports instrument9 image2)
	(calibration_target instrument9 Star4)
	(calibration_target instrument9 Star3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation5)
)
(:goal (and
	(pointing satellite0 Planet16)
	(pointing satellite2 Planet10)
	(pointing satellite3 GroundStation5)
	(have_image Phenomenon6 image1)
	(have_image Star7 image1)
	(have_image Phenomenon8 infrared0)
	(have_image Planet9 image1)
	(have_image Planet10 image2)
	(have_image Phenomenon11 image1)
	(have_image Planet12 image2)
	(have_image Planet13 image2)
	(have_image Planet14 infrared0)
	(have_image Phenomenon15 infrared0)
	(have_image Planet16 infrared0)
	(have_image Planet17 image2)
))

)

; plan
1. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 1 of 15
2. (calibrate satellite0 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 1 of 15
3. (turn_to satellite0 planet12 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet12)
   goals met: 1 of 15
4. (take_image satellite0 planet12 instrument2 image2)
   added: (have_image planet12 image2)
   goals met: 2 of 15
5. (turn_to satellite0 planet10 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet10)
   goals met: 2 of 15
6. (take_image satellite0 planet10 instrument2 image2)
   added: (have_image planet10 image2)
   goals met: 3 of 15
7. (turn_to satellite0 phenomenon8 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 15
8. (take_image satellite0 phenomenon8 instrument2 infrared0)
   added: (have_image phenomenon8 infrared0)
   goals met: 4 of 15
9. (turn_to satellite0 phenomenon6 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 15
10. (take_image satellite0 phenomenon6 instrument2 image1)
   added: (have_image phenomenon6 image1)
   goals met: 5 of 15
11. (turn_to satellite0 phenomenon15 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon15)
   goals met: 5 of 15
12. (take_image satellite0 phenomenon15 instrument2 infrared0)
   added: (have_image phenomenon15 infrared0)
   goals met: 6 of 15
13. (turn_to satellite0 phenomenon11 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon11)
   goals met: 6 of 15
14. (take_image satellite0 phenomenon11 instrument2 image1)
   added: (have_image phenomenon11 image1)
   goals met: 7 of 15
15. (turn_to satellite0 planet13 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet13)
   goals met: 7 of 15
16. (take_image satellite0 planet13 instrument2 image2)
   added: (have_image planet13 image2)
   goals met: 8 of 15
17. (turn_to satellite0 planet14 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet14)
   goals met: 8 of 15
18. (take_image satellite0 planet14 instrument2 infrared0)
   added: (have_image planet14 infrared0)
   goals met: 9 of 15
19. (turn_to satellite0 planet17 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet17)
   goals met: 9 of 15
20. (take_image satellite0 planet17 instrument2 image2)
   added: (have_image planet17 image2)
   goals met: 10 of 15
21. (turn_to satellite0 planet9 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 planet9)
   goals met: 10 of 15
22. (take_image satellite0 planet9 instrument2 image1)
   added: (have_image planet9 image1)
   goals met: 11 of 15
23. (turn_to satellite0 star7 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star7)
   goals met: 11 of 15
24. (take_image satellite0 star7 instrument2 image1)
   added: (have_image star7 image1)
   goals met: 12 of 15
25. (turn_to satellite0 planet16 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet16)
   goals met: 13 of 15
26. (take_image satellite0 planet16 instrument2 infrared0)
   added: (have_image planet16 infrared0)
   goals met: 14 of 15
27. (turn_to satellite2 planet10 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 planet10)
   goals met: 15 of 15
